In [27]:
import pandas as pd
import numpy as np
data_x=pd.read_excel('/Users/atiqurrahman/Documents/demodata.xlsx')


#create dataframe
data = {
    "Name":["Jhon","peter","Lisa"],
    "Age":["25","28","31"],
    "Salary":[30000,45000,65000]
}
print(pd.DataFrame(data))

    Name Age  Salary
0   Jhon  25   30000
1  peter  28   45000
2   Lisa  31   65000

In [10]:
#load csv file
data_c = pd.read_csv('/Users/atiqurrahman/Documents/mycsv.csv')
print(data_c)

    1    3  -213.25   38.94
0   2  293   457.81  208.16
1   3  293    46.71    8.69
2   4  483  1198.97  195.99
3   5  515    30.94   21.78
4   6  515     4.43    6.64
5   7  613   -54.04    7.30
6   8  613   127.70   42.76
7   9  643  -695.26  138.14
8  10  678  -226.36    4.98

In [3]:
#load excel file
#data_x=pd.read_excel('/Users/atiqurrahman/Documents/demodata.xlsx')
print(data_x)
print(data_x.head(10))
print(data_x.tail(10))

  First Name        Country   Age        Date  Id  Bonus%
0      Dulce  United States  32.0  15/10/2017  10       0
1       Mara  Great Britain   NaN  16/08/2016  11       1
2     Philip         France  36.0  21/05/2015  12       3
3   Kathleen       Kathleen  13.0  15/10/2017  13       2
4     Philip            NaN  58.0  16/08/2016  14       0
5     Gaston  United States  24.0  21/05/2015  15       0
6       Etta          Japan   NaN  15/10/2017  16       0
7      Talli         Norway  45.0  15/10/2017  17       1
  First Name        Country   Age        Date  Id  Bonus%
0      Dulce  United States  32.0  15/10/2017  10       0
1       Mara  Great Britain   NaN  16/08/2016  11       1
2     Philip         France  36.0  21/05/2015  12       3
3   Kathleen       Kathleen  13.0  15/10/2017  13       2
4     Philip            NaN  58.0  16/08/2016  14       0
5     Gaston  United States  24.0  21/05/2015  15       0
6       Etta          Japan   NaN  15/10/2017  16       0
7      Talli         Norway  45.0  15/10/2017  17       1
  First Name        Country   Age        Date  Id  Bonus%
0      Dulce  United States  32.0  15/10/2017  10       0
1       Mara  Great Britain   NaN  16/08/2016  11       1
2     Philip         France  36.0  21/05/2015  12       3
3   Kathleen       Kathleen  13.0  15/10/2017  13       2
4     Philip            NaN  58.0  16/08/2016  14       0
5     Gaston  United States  24.0  21/05/2015  15       0
6       Etta          Japan   NaN  15/10/2017  16       0
7      Talli         Norway  45.0  15/10/2017  17       1

In [18]:
#get information of data
print(data_x.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  8 non-null      object
 1   Country     7 non-null      object
 2   Age         6 non-null      float64
 3   Date        8 non-null      object
 4   Id          8 non-null      int64
 5   Bonus%      8 non-null      int64
 6   Gender      8 non-null      object
dtypes: float64(1), int64(2), object(4)
memory usage: 580.0+ bytes
None

In [19]:
#describe some important parameter about data
print(data_x.describe())

             Age         Id
count   5.000000   7.000000
mean   41.200000  13.000000
std    15.073155   2.160247
min    24.000000  10.000000
25%    32.000000  11.500000
50%    36.000000  13.000000
75%    56.000000  14.500000
max    58.000000  16.000000

In [7]:
#show the null valus
print(data_x.isnull())
print(data_x.isnull().sum())

   First Name  Country    Age   Date     Id
0       False    False  False  False  False
1       False    False   True  False  False
2       False    False  False  False  False
3       False    False  False  False  False
4       False     True  False  False  False
5       False    False  False  False  False
6       False    False  False  False  False
First Name    0
Country       1
Age           1
Date          0
Id            0
dtype: int64

In [9]:
#check the duplicate valu in every row
print(data_x.duplicated())

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [31]:
#check the duplicate value in ID column
print(data_x["Id"].duplicated())

0    False
2    False
3    False
5    False
6    False
Name: Id, dtype: bool

In [10]:
#drop the duplicate row by country
print(data_x.drop_duplicates("Country"))

  First Name        Country   Age        Date  Id
0      Dulce  United States  32.0  15/10/2017  10
1       Mara  Great Britain   NaN  16/08/2016  11
2     Philip         France  36.0  21/05/2015  12
3   Kathleen       Kathleen  13.0  15/10/2017  13
4     Philip            NaN  58.0  16/08/2016  14
6       Etta          Japan  56.0  15/10/2017  16

In [3]:
print(data_x)

  First Name        Country   Age        Date  Id  Bonus%
0      Dulce  United States  32.0  15/10/2017  10       0
1       Mara  Great Britain   NaN  16/08/2016  11       1
2     Philip         France  36.0  21/05/2015  12       3
3   Kathleen       Kathleen  13.0  15/10/2017  13       2
4     Philip            NaN  58.0  16/08/2016  14       0
5     Gaston  United States  24.0  21/05/2015  15       0
6       Etta          Japan   NaN  15/10/2017  16       0
7      Talli         Norway  45.0  15/10/2017  17       1

In [12]:
# replace all null value with 99999
print (data_x.fillna(90000000))
print (data_x.replace(np.nan,99999))

  First Name        Country         Age        Date  Id
0      Dulce  United States        32.0  15/10/2017  10
1       Mara  Great Britain  90000000.0  16/08/2016  11
2     Philip         France        36.0  21/05/2015  12
3   Kathleen       Kathleen        13.0  15/10/2017  13
4     Philip       90000000        58.0  16/08/2016  14
5     Gaston  United States        24.0  21/05/2015  15
6       Etta          Japan        56.0  15/10/2017  16
  First Name        Country      Age        Date  Id
0      Dulce  United States     32.0  15/10/2017  10
1       Mara  Great Britain  99999.0  16/08/2016  11
2     Philip         France     36.0  21/05/2015  12
3   Kathleen       Kathleen     13.0  15/10/2017  13
4     Philip          99999     58.0  16/08/2016  14
5     Gaston  United States     24.0  21/05/2015  15
6       Etta          Japan     56.0  15/10/2017  16

In [10]:
#replace the data in Age column by 35.55
data_x["Age"]=data_x["Age"].replace(np.nan,35.55)
print(data_x)

  First Name        Country    Age        Date  Id
0      Dulce  United States  32.00  15/10/2017  10
1       Mara  Great Britain  35.55  16/08/2016  11
2     Philip         France  36.00  21/05/2015  12
3   Kathleen       Kathleen  13.00  15/10/2017  13
4     Philip  United States  58.00  16/08/2016  14
5     Gaston  United States  24.00  21/05/2015  15
6       Etta          Japan  56.00  15/10/2017  16

In [5]:
#fill null value backwordly
data_x["Country"]=data_x["Country"].bfill()
print(data_x)

  First Name        Country   Age        Date  Id  Bonus%
0      Dulce  United States  32.0  15/10/2017  10       0
1       Mara  Great Britain   NaN  16/08/2016  11       1
2     Philip         France  36.0  21/05/2015  12       3
3   Kathleen       Kathleen  13.0  15/10/2017  13       2
4     Philip  United States  58.0  16/08/2016  14       0
5     Gaston  United States  24.0  21/05/2015  15       0
6       Etta          Japan   NaN  15/10/2017  16       0
7      Talli         Norway  45.0  15/10/2017  17       1

In [15]:
#transform a column to another by condition
data_x.loc[data_x["Bonus%"]==0,"GetBonus"]="No Bonus"
data_x.loc[data_x["Bonus%"]>0,"GetBonus"]="Bonus"
print(data_x)

  First Name        Country   Age        Date  Id  Bonus%  GetBonus
0      Dulce  United States  32.0  15/10/2017  10       0  No Bonus
1       Mara  Great Britain   NaN  16/08/2016  11       1     Bonus
2     Philip         France  36.0  21/05/2015  12       3     Bonus
3   Kathleen       Kathleen  13.0  15/10/2017  13       2     Bonus
4     Philip            NaN  58.0  16/08/2016  14       0  No Bonus
5     Gaston  United States  24.0  21/05/2015  15       0  No Bonus
6       Etta          Japan   NaN  15/10/2017  16       0  No Bonus
7      Talli         Norway  45.0  15/10/2017  17       1     Bonus

In [16]:
#add column 
data_x["Full Name"]=data_x["First Name"]+" "+data_x["Country"]
print(data_x)

  First Name        Country   Age        Date  Id  Bonus%  GetBonus  \
0      Dulce  United States  32.0  15/10/2017  10       0  No Bonus
1       Mara  Great Britain   NaN  16/08/2016  11       1     Bonus
2     Philip         France  36.0  21/05/2015  12       3     Bonus
3   Kathleen       Kathleen  13.0  15/10/2017  13       2     Bonus
4     Philip            NaN  58.0  16/08/2016  14       0  No Bonus
5     Gaston  United States  24.0  21/05/2015  15       0  No Bonus
6       Etta          Japan   NaN  15/10/2017  16       0  No Bonus
7      Talli         Norway  45.0  15/10/2017  17       1     Bonus

              Full Name
0   Dulce United States
1    Mara Great Britain
2         Philip France
3     Kathleen Kathleen
4                   NaN
5  Gaston United States
6            Etta Japan
7          Talli Norway

In [8]:
#column transformation
data_x["ID Percent"]=(data_x["Id"]*20)/100
print(data_x)

  First Name        Country   Age        Date  Id  Bonus%  ID Percent
0      Dulce  United States  32.0  15/10/2017  10       0         2.0
1       Mara  Great Britain   NaN  16/08/2016  11       1         2.2
2     Philip         France  36.0  21/05/2015  12       3         2.4
3   Kathleen       Kathleen  13.0  15/10/2017  13       2         2.6
4     Philip            NaN  58.0  16/08/2016  14       0         2.8
5     Gaston  United States  24.0  21/05/2015  15       0         3.0
6       Etta          Japan   NaN  15/10/2017  16       0         3.2
7      Talli         Norway  45.0  15/10/2017  17       1         3.4

In [17]:
print(data_x)

  First Name        Country   Age        Date  Id  Bonus%  Gender
0      Dulce  United States  32.0  15/10/2017  10       0    Male
1       Mara  Great Britain   NaN  16/08/2016  11       1  Female
2     Philip         France  36.0  21/05/2015  12       3    Male
3   Kathleen       Kathleen  13.0  15/10/2017  13       2  Female
4     Philip            NaN  58.0  16/08/2016  14       0    Male
5     Gaston  United States  24.0  21/05/2015  15       0    Male
6       Etta          Japan   NaN  15/10/2017  16       0  Female
7      Talli         Norway  45.0  15/10/2017  17       1    Male

In [28]:
#Groupby Method
gp1=data_x.groupby(["Country","Gender"]).agg({"Id":"count"})
print(gp1)

                      Id
Country       Gender
France        Female   1
              Male     2
Japan         Female   2
United States Female   1
              Male     1

In [35]:
gp2=data_x.groupby(["Country"]).agg({"Age":"mean","Id":"max"})
print(gp2)

                Age  Id
Country
France         40.5  17
Japan          13.0  16
United States  28.0  15

In [14]:
# Marge & concatinate
import pandas as pd
data1={"ID":["01","02","03","04","05"],
       "Name":["Atiq","Rasha","Tomal","Shakil","Fardin"],
       "Age":["","24","","25","22"]}
data2={"ID":["01","02","03","04","07"],
       "Salary":["40000","60000","80000","70000","60000"]}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
print(df1)
print(df2)

   ID    Name Age
0  01    Atiq
1  02   Rasha  24
2  03   Tomal
3  04  Shakil  25
4  05  Fardin  22
   ID Salary
0  01  40000
1  02  60000
2  03  80000
3  04  70000
4  07  60000

In [15]:
print(pd.merge(df1,df2,on="ID",how="left" ))
#print(pd.merge(df1,df2,on="ID",how="full" ))

   ID    Name Age Salary
0  01    Atiq      40000
1  02   Rasha  24  60000
2  03   Tomal      80000
3  04  Shakil  25  70000
4  05  Fardin  22    NaN

In [16]:
print(pd.concat([df1,df2]))

   ID    Name  Age Salary
0  01    Atiq         NaN
1  02   Rasha   24    NaN
2  03   Tomal         NaN
3  04  Shakil   25    NaN
4  05  Fardin   22    NaN
0  01     NaN  NaN  40000
1  02     NaN  NaN  60000
2  03     NaN  NaN  80000
3  04     NaN  NaN  70000
4  07     NaN  NaN  60000

In [1]:
#compare data
import pandas as pd
dict= { "Fruits":["Mango","Apples","Banana","Papaya",],
        "Price": [100,150,50,35],
        "Quantity": [15,10,5,3]}
df1= pd.DataFrame(dict)
print(df1)

   Fruits  Price  Quantity
0   Mango    100        15
1  Apples    150        10
2  Banana     50         5
3  Papaya     35         3
   Fruits  Price  Quantity
0   Mango    100        15
1  Apples    150        10
2  Banana     50         5
3  Papaya     35         3

In [4]:
df2=df1.copy()
df2.loc[0,"Price"]=150
df2.loc[1,"Price"]=200
df2.loc[3,"Price"]=70
df2.loc[0,"Quantity"]=10
df2.loc[1,"Quantity"]=20
df2.loc[3,"Quantity"]=10


print(df1.compare(df2))

   Price        Quantity
    self  other     self other
0  100.0  150.0     15.0  10.0
1  150.0  200.0     10.0  20.0
3   35.0   70.0      3.0  10.0

In [7]:
#pivoting
import pandas as pd
dict ={"Keys":["K1","K2","k1","K2"],
       "Names":["Jhon","Ben","David","Peter"],
       "Houses":["red","blue","green","red"]}
df=pd.DataFrame(dict)
print(df)

  Keys  Names Houses
0   K1   Jhon    red
1   K2    Ben   blue
2   k1  David  green
3   K2  Peter    red

In [9]:
print(df.pivot("Keys","Names"))

TypeError: DataFrame.pivot() takes 1 positional argument but 3 were given